package arrayTest;

import java.util.Scanner;

public class MyArTask2 {
   public static void main(String[] args) {
//      각 버튼을 눌렀을 때, 이동하는 페이지는 다음과 같다.
      
//      btn1 : 회원가입 페이지
//      btn2 : 로그인 페이지
//      btn3 : 마이 페이지
      
//      회원가입 -> 로그인 -> 마이 페이지
//      위 순서대로 입력해야 하며, 만약 이전 단계를 진행하기 전에 다음 단계 버튼을 누를 경우, 이전 단계에 대한 메세지를 출력해준다.
//      예) 로그인 클릭 시, "회원가입을 먼저 진행해주세요" 출력
      
//      알맞은 단계의 버튼을 누르면, 해당 단계에 대한 메세지를 출력해준다.
//      예)   회원가입 클릭 시, 회원가입 성공
//         마이 페이지 클릭 시, 본인 이름과 나이 출력
      

      
   }
}
